In [35]:
import numpy as np
import pandas as pd

In [3]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
type(obj.values)

numpy.ndarray

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d','b','a','c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2['d']

4

In [10]:
obj2[['c','a']]

c    3
a   -5
dtype: int64

In [11]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [12]:
'e' in obj2

False

In [13]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}

In [14]:
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [15]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [16]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [17]:
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [18]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [20]:
#data frame

In [21]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Neveda', 'Neveda', 'Neveda'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

In [22]:
frame = pd.DataFrame(data)

In [23]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Neveda  2001  2.4
4  Neveda  2002  2.9
5  Neveda  2003  3.2

In [24]:
frame.head() #print 5 elements

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Neveda  2001  2.4
4  Neveda  2002  2.9

In [25]:
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Neveda  2.4
4  2002  Neveda  2.9
5  2003  Neveda  3.2

In [26]:
frame2 = pd.DataFrame(data, columns=['year','state','pop','debt'], index=['one','two','three','four','five','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Neveda  2.4  NaN
five   2002  Neveda  2.9  NaN
six    2003  Neveda  3.2  NaN

In [27]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [28]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Neveda
five     Neveda
six      Neveda
Name: state, dtype: object

In [29]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Neveda
five     Neveda
six      Neveda
Name: state, dtype: object

In [30]:
frame2.loc['three'] #using index name ==> loc

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [31]:
frame2.iloc[2] #using index number ==> iloc

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [32]:
frame2['debt'] = 16.5

In [33]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Neveda  2.4  16.5
five   2002  Neveda  2.9  16.5
six    2003  Neveda  3.2  16.5

In [36]:
frame2['debt'] = np.arange(6.0)

In [37]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Neveda  2.4   3.0
five   2002  Neveda  2.9   4.0
six    2003  Neveda  3.2   5.0

In [38]:
frame2['eastern'] = frame2.state == 'Ohio' #create new column and store the boolean value
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   0.0     True
two    2001    Ohio  1.7   1.0     True
three  2002    Ohio  3.6   2.0     True
four   2001  Neveda  2.4   3.0    False
five   2002  Neveda  2.9   4.0    False
six    2003  Neveda  3.2   5.0    False

In [39]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five']) #alignment
frame2['debt'] = val
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Neveda  2.4  -1.5    False
five   2002  Neveda  2.9  -1.7    False
six    2003  Neveda  3.2   NaN    False

In [40]:
pop = {
    'Nevada': {2001: 2.4, 2002: 2.9},
    'Ohio':{2000: 1.5, 2001: 1.7, 2002: 3.6}
} #dictionary of dictionary ==> outer key -> name, inner key -> index

In [42]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [43]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [48]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [49]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [50]:
df = pd.DataFrame([[1.4, np.nan],
                   [7.1, -4.5],
                   [np.nan, np.nan],
                   [0.75, -1.3]],
                  index = ['a','b','c','d'],
                  columns = ['one','two']
)
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [51]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [52]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [53]:
df.sum(axis=1) #by default, NaN value ignored

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [54]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [55]:
df.idxmax() #return index name which has max value by each column

one    b
two    d
dtype: object

In [56]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [57]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000